In [2]:
import numpy as np
import pandas as pd

In [3]:
# Series 생성
s = pd.Series([1,3,5,np.nan,6,8])

In [4]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [10]:
dates = pd.date_range('20130101',periods=6)
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=['A','B','C','D'])

In [11]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df

                   A         B         C         D
2013-01-01  1.181412  0.271141 -0.435712  0.862857
2013-01-02 -0.931291  0.347380  0.096542 -0.486715
2013-01-03 -1.670862  0.058267 -0.709623  0.716879
2013-01-04  0.849295 -1.020308  2.842850 -0.631009
2013-01-05 -2.222847  0.316455  0.236681 -1.020273
2013-01-06 -0.920816 -0.037149 -1.124056  0.813197

In [13]:
df_dict = pd.DataFrame(
    {'A':1,
     'B':pd.Timestamp('20130101'),
     'C':pd.Series(1,index=list(range(4)),dtype='float32'),
     'D':np.array([3]*4,dtype='int32'),
     'E':pd.Categorical(['test','train','test','train']),
     'F':'str'}
)

In [14]:
df_dict

   A          B    C  D      E    F
0  1 2013-01-01  1.0  3   test  str
1  1 2013-01-01  1.0  3  train  str
2  1 2013-01-01  1.0  3   test  str
3  1 2013-01-01  1.0  3  train  str

### 데이터 확인하기

In [15]:
df.head()

                   A         B         C         D
2013-01-01  1.181412  0.271141 -0.435712  0.862857
2013-01-02 -0.931291  0.347380  0.096542 -0.486715
2013-01-03 -1.670862  0.058267 -0.709623  0.716879
2013-01-04  0.849295 -1.020308  2.842850 -0.631009
2013-01-05 -2.222847  0.316455  0.236681 -1.020273

In [16]:
df.tail()

                   A         B         C         D
2013-01-02 -0.931291  0.347380  0.096542 -0.486715
2013-01-03 -1.670862  0.058267 -0.709623  0.716879
2013-01-04  0.849295 -1.020308  2.842850 -0.631009
2013-01-05 -2.222847  0.316455  0.236681 -1.020273
2013-01-06 -0.920816 -0.037149 -1.124056  0.813197

In [17]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [18]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [19]:
df.values

array([[ 1.18141236,  0.27114059, -0.43571233,  0.86285739],
       [-0.93129088,  0.34737955,  0.09654164, -0.48671486],
       [-1.67086154,  0.05826747, -0.70962279,  0.71687924],
       [ 0.849295  , -1.02030794,  2.84284993, -0.63100882],
       [-2.22284744,  0.31645475,  0.23668092, -1.02027266],
       [-0.92081568, -0.03714904, -1.12405638,  0.81319692]])

In [20]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.619185 -0.010702  0.151113  0.042490
std    1.361230  0.517581  1.411881  0.846749
min   -2.222847 -1.020308 -1.124056 -1.020273
25%   -1.485969 -0.013295 -0.641145 -0.594935
50%   -0.926053  0.164704 -0.169585  0.115082
75%    0.406767  0.305126  0.201646  0.789117
max    1.181412  0.347380  2.842850  0.862857

In [21]:
df_dict.describe()

         A                    B    C    D
count  4.0                    4  4.0  4.0
mean   1.0  2013-01-01 00:00:00  1.0  3.0
min    1.0  2013-01-01 00:00:00  1.0  3.0
25%    1.0  2013-01-01 00:00:00  1.0  3.0
50%    1.0  2013-01-01 00:00:00  1.0  3.0
75%    1.0  2013-01-01 00:00:00  1.0  3.0
max    1.0  2013-01-01 00:00:00  1.0  3.0
std    0.0                  NaN  0.0  0.0

In [22]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.181412   -0.931291   -1.670862    0.849295   -2.222847   -0.920816
B    0.271141    0.347380    0.058267   -1.020308    0.316455   -0.037149
C   -0.435712    0.096542   -0.709623    2.842850    0.236681   -1.124056
D    0.862857   -0.486715    0.716879   -0.631009   -1.020273    0.813197

In [24]:
df.sort_index(ascending=False)

                   A         B         C         D
2013-01-06 -0.920816 -0.037149 -1.124056  0.813197
2013-01-05 -2.222847  0.316455  0.236681 -1.020273
2013-01-04  0.849295 -1.020308  2.842850 -0.631009
2013-01-03 -1.670862  0.058267 -0.709623  0.716879
2013-01-02 -0.931291  0.347380  0.096542 -0.486715
2013-01-01  1.181412  0.271141 -0.435712  0.862857

In [26]:
df.sort_values(by='B',ascending=False)

                   A         B         C         D
2013-01-02 -0.931291  0.347380  0.096542 -0.486715
2013-01-05 -2.222847  0.316455  0.236681 -1.020273
2013-01-01  1.181412  0.271141 -0.435712  0.862857
2013-01-03 -1.670862  0.058267 -0.709623  0.716879
2013-01-06 -0.920816 -0.037149 -1.124056  0.813197
2013-01-04  0.849295 -1.020308  2.842850 -0.631009

## 데이터 선택하기

In [27]:
df['A']

2013-01-01    1.181412
2013-01-02   -0.931291
2013-01-03   -1.670862
2013-01-04    0.849295
2013-01-05   -2.222847
2013-01-06   -0.920816
Freq: D, Name: A, dtype: float64

In [28]:
type(df['A'])

pandas.core.series.Series

In [29]:
df[0:3]

                   A         B         C         D
2013-01-01  1.181412  0.271141 -0.435712  0.862857
2013-01-02 -0.931291  0.347380  0.096542 -0.486715
2013-01-03 -1.670862  0.058267 -0.709623  0.716879

In [30]:
## 인덱스 명에 해당하는 값
df['2013-01-02':'2013-01-05']

                   A         B         C         D
2013-01-02 -0.931291  0.347380  0.096542 -0.486715
2013-01-03 -1.670862  0.058267 -0.709623  0.716879
2013-01-04  0.849295 -1.020308  2.842850 -0.631009
2013-01-05 -2.222847  0.316455  0.236681 -1.020273

In [31]:
df.loc['2013-01-01','A']

1.1814123643123602

In [32]:
df.loc['2013-01-01']

A    1.181412
B    0.271141
C   -0.435712
D    0.862857
Name: 2013-01-01 00:00:00, dtype: float64

In [33]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  1.181412  0.271141
2013-01-02 -0.931291  0.347380
2013-01-03 -1.670862  0.058267
2013-01-04  0.849295 -1.020308
2013-01-05 -2.222847  0.316455
2013-01-06 -0.920816 -0.037149

In [34]:
df[['A','B']]

                   A         B
2013-01-01  1.181412  0.271141
2013-01-02 -0.931291  0.347380
2013-01-03 -1.670862  0.058267
2013-01-04  0.849295 -1.020308
2013-01-05 -2.222847  0.316455
2013-01-06 -0.920816 -0.037149

In [35]:
df.loc[dates[0],'A']

1.1814123643123602

In [37]:
df.iloc[3]

A    0.849295
B   -1.020308
C    2.842850
D   -0.631009
Name: 2013-01-04 00:00:00, dtype: float64

In [38]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.849295 -1.020308
2013-01-05 -2.222847  0.316455

In [39]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.931291  0.096542
2013-01-03 -1.670862 -0.709623
2013-01-05 -2.222847  0.236681

In [40]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -0.931291  0.347380  0.096542 -0.486715
2013-01-03 -1.670862  0.058267 -0.709623  0.716879

### 조건으로 가져오기

In [42]:
df[df['A']>0]

                   A         B         C         D
2013-01-01  1.181412  0.271141 -0.435712  0.862857
2013-01-04  0.849295 -1.020308  2.842850 -0.631009

In [43]:
df[df>0]

                   A         B         C         D
2013-01-01  1.181412  0.271141       NaN  0.862857
2013-01-02       NaN  0.347380  0.096542       NaN
2013-01-03       NaN  0.058267       NaN  0.716879
2013-01-04  0.849295       NaN  2.842850       NaN
2013-01-05       NaN  0.316455  0.236681       NaN
2013-01-06       NaN       NaN       NaN  0.813197

### isin 함수

In [44]:
df_isin = pd.DataFrame({'A':[1,2,3],'B':['a','b','c']})
df_isin.isin([1,3,12,'a'])

       A      B
0   True   True
1  False  False
2   True  False

In [45]:
df_isin[df_isin['A'].isin([1,2])]

   A  B
0  1  a
1  2  b

In [46]:
# 테이블 복사
df2 = df.copy()

In [48]:
# 새로운 컬럼 E 를 추가
df2['E'] = ['one','one','two','two','three','three']
df2

                   A         B         C         D      E
2013-01-01  1.181412  0.271141 -0.435712  0.862857    one
2013-01-02 -0.931291  0.347380  0.096542 -0.486715    one
2013-01-03 -1.670862  0.058267 -0.709623  0.716879    two
2013-01-04  0.849295 -1.020308  2.842850 -0.631009    two
2013-01-05 -2.222847  0.316455  0.236681 -1.020273  three
2013-01-06 -0.920816 -0.037149 -1.124056  0.813197  three

In [49]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D    E
2013-01-03 -1.670862  0.058267 -0.709623  0.716879  two
2013-01-04  0.849295 -1.020308  2.842850 -0.631009  two

In [50]:
df2[~df2['E'].isin(['two','four'])]

                   A         B         C         D      E
2013-01-01  1.181412  0.271141 -0.435712  0.862857    one
2013-01-02 -0.931291  0.347380  0.096542 -0.486715    one
2013-01-05 -2.222847  0.316455  0.236681 -1.020273  three
2013-01-06 -0.920816 -0.037149 -1.124056  0.813197  three

### 데이터 변경하기

In [51]:
s1 = pd.Series([1,2,3,4,5,6],index=pd.date_range('20130102',periods=6))

In [52]:
df['F'] = s1

In [53]:
df

                   A         B         C         D    F
2013-01-01  1.181412  0.271141 -0.435712  0.862857  NaN
2013-01-02 -0.931291  0.347380  0.096542 -0.486715  1.0
2013-01-03 -1.670862  0.058267 -0.709623  0.716879  2.0
2013-01-04  0.849295 -1.020308  2.842850 -0.631009  3.0
2013-01-05 -2.222847  0.316455  0.236681 -1.020273  4.0
2013-01-06 -0.920816 -0.037149 -1.124056  0.813197  5.0

In [56]:
# 0 번째 인덱스, A 컬럼을 0으로 변경
df.loc[dates[0],'A'] = 0

In [57]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.271141 -0.435712  0.862857  NaN
2013-01-02 -0.931291  0.347380  0.096542 -0.486715  1.0
2013-01-03 -1.670862  0.058267 -0.709623  0.716879  2.0
2013-01-04  0.849295 -1.020308  2.842850 -0.631009  3.0
2013-01-05 -2.222847  0.316455  0.236681 -1.020273  4.0
2013-01-06 -0.920816 -0.037149 -1.124056  0.813197  5.0

In [59]:
# 0번째 인덱스, 1번째 컬럼을 0으로 변경
df.iloc[0,1] = 0

In [60]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -0.435712  0.862857  NaN
2013-01-02 -0.931291  0.347380  0.096542 -0.486715  1.0
2013-01-03 -1.670862  0.058267 -0.709623  0.716879  2.0
2013-01-04  0.849295 -1.020308  2.842850 -0.631009  3.0
2013-01-05 -2.222847  0.316455  0.236681 -1.020273  4.0
2013-01-06 -0.920816 -0.037149 -1.124056  0.813197  5.0

In [61]:
df.loc[:,'D'] = np.array([5]*len(df))

In [62]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.435712  5.0  NaN
2013-01-02 -0.931291  0.347380  0.096542  5.0  1.0
2013-01-03 -1.670862  0.058267 -0.709623  5.0  2.0
2013-01-04  0.849295 -1.020308  2.842850  5.0  3.0
2013-01-05 -2.222847  0.316455  0.236681  5.0  4.0
2013-01-06 -0.920816 -0.037149 -1.124056  5.0  5.0